public class num3 {
    public static void main(String[] args) {
        System.out.printf("| %s | %-31s | %20s |%n", "№", "Ключ", "Количество переходов");
        System.out.printf("|%s|%-31s|%20s|%n", "---", "---------------------------------", "----------------------");
        System.out.printf("| %d | %-31s | %20s |%n", 1, "Купить квартиру недорого", "225 406");
        System.out.printf("| %d | %-31s | %20s |%n", 2, "Купить квартиру в Ярославле", "137 489");
        System.out.printf("| %d | %-30s | %20s |%n", 3, "Купить квартиру без посредников", "87 478");
    }
}
